from flask import Flask, request, abort,render_template
import livejson,json,random
from youtubesearchpython import Search
import tempfile
import ffmpeg
import os
import glob
import speech_recognition as sr
from utils import get_user_profile,get_profile
from os.path import splitext
from linebot.v3 import (
    WebhookHandler
)
from linebot.v3.models import (
    UnknownEvent
)
from linebot.v3.exceptions import (
    InvalidSignatureError
)
from linebot.v3.webhooks import (
    MessageEvent,
    TextMessageContent,
    LocationMessageContent,
    StickerMessageContent,
    ImageMessageContent,
    VideoMessageContent,
    AudioMessageContent,
    FileMessageContent,
    UserSource,
    RoomSource,
    GroupSource,
    FollowEvent,
    UnfollowEvent,
    JoinEvent,
    LeaveEvent,
    PostbackEvent,
    BeaconEvent,
    MemberJoinedEvent,
    MemberLeftEvent,
    UnsendEvent
)
from linebot.v3.messaging import (
    Configuration,
    ApiClient,
    MessagingApi,
    MessagingApiBlob,
    ReplyMessageRequest,
    PushMessageRequest,
    MulticastRequest,
    BroadcastRequest,
    TextMessage,
    ApiException,
    LocationMessage,
    StickerMessage,
    ImageMessage,
    TemplateMessage,
    FlexMessage,
    Emoji,
    QuickReply,
    QuickReplyItem,
    ConfirmTemplate,
    ButtonsTemplate,
    CarouselTemplate,
    CarouselColumn,
    ImageCarouselTemplate,
    ImageCarouselColumn,
    FlexBubble,
    FlexImage,
    FlexBox,
    FlexText,
    FlexIcon,
    FlexButton,
    FlexSeparator,
    FlexContainer,
    MessageAction,
    URIAction,
    PostbackAction,
    DatetimePickerAction,
    CameraAction,
    CameraRollAction,
    LocationAction,
    ErrorResponse
)

from linebot.v3.insight import (
    ApiClient as InsightClient,
    Insight
)
from linebot.models.unsend import Unsend
import qrcode
from PIL import Image
import bs4
import requests

import re
from ngcheck import NgWordSystem
NgWordSystem = NgWordSystem()

def remove_inappropriate_words(text):
    inappropriate_words_h = [
        "あいぬけい", "あいのこ", "あおかん", "あか", "あきめくら", "あしきり", "あしをあらう", "あてうま", "あめこう", "あらめん", 
        "あるちゅう", "あんま", "いえがら", "いかさま", "いざり", "いせこじき", "いたこう", "いたまえ", "いちゃもん", "いなか", 
        "いぬごろし", "いみん", "いも", "いんちき", "いんでぃあんうそつかない", "いんばい", "うらにほん", "うんこ", "うんちゃん", 
        "えすきもー", "えた", "えちごのこめつき", "えちぜんくらげ", "えでぃたー", "おーえる", "おーるどみす", "おかま", 
        "おきなかし", "おし", "おちうどぶらく", "おちこぼれ", "おとしまえ", "おぼれじぬ", "おまわり", "おもてにほん", "おやかた", "おわいや", 
        "おんなこども", "おんなのくさったような", "おんぼう", "がいじん", "かえるのこはかえる", "がき", "かくしんはん", "かくちょういん", "かくちょうだん", 
        "かくちょうだんちょう", "かけい", "かこちょう", "がさ", "かさっかき", "かたあし", "かたおや", "かたておち", "かたはい", "かため", 
        "かたわ", "がちゃめ", "かつぎや", "かったい", "がっぷりよつ", "かっぺ", "かみがたのぜいろく", "かりばら", "かわかぶり", 
        "かわきり", "かわむこう", "かわらこじき", "かんごふ", "かんつう", "きじるし", "きち", "きちがい", "きちがいざた", "きちがいにはもの", 
        "ぎっちょ", "きゅうじ", "きゅうをすえる", "きょうき", "きょうきのさた", "きょうじょ", "きょうじん", "ぎょふ", "くーりー", "くずや", 
        "ぐどん", "くびきり", "くみとりや", "くるう", "くろ", "くろんぼ", "くわえこむ", "くんに", "ぐんもうぞうをなでる", "げいにん", 
        "げーせん", "げじょ", "けっとう", "けとう", "げなん", "けんぜんなるせいしんはけんぜんなるしんたいにやどる", "げんなま", "ごうかん", "こうしんこく", "こうしんじょ", 
        "ごうびょう", "こうふ", "こうふ", "こうふ", "こうもうじん", "こくじん", "こけ", "こじいん", "こじき", "こぞう", 
        "こづかい", "こども", "こびと", "ごみや", "ころし", "さかなや", "ざぎん", "さつ", "さらきん", "さらぶれっど", 
        "さんかんせいばつ", "さんごくじん", "さんすけ", "さんば", "しきもう", "しな", "しなじん", "しなそば", "しなちく", "しなりょうり", 
        "しのうこうしょう", "じぷしー", "じへいしょうじ", "しま", "じまわり", "じゃっぷ", "じゃり", "じゅー", "じゅうい", "しゅうせんや", 
        "しゅうちょう", "じょう", "しょうがいしゃ", "しょうぎだおしになる", "じょうふ", "じょうふ", "じょきゅう", "しょくぶつにんげん", "じょけつ", "じょこう", 
        "じょさんぷ", "しょじょさく", "しょじょほう", "じょちゅう", "しょっこう", "しらっこ", "しりぬぐい", "しんしょうじ", "しんしょうしゃ", "しんへいみん", 
        "ずーじゃー", "すけ", "すけこまし", "すちゅわーです", "すべりどめ", "ずらかる", "すらむ", "せいさい", "せいしんいじょう", "せいしんぶんれつびょう", 
        "せいはく", "せむし", "せんじん", "せんすいふ", "せんずり", "せんろこうふ", "そうじふ", "そうじふ", "ぞうやくふ", "そだちよりうじ", 
        "だいさんごく", "だいしょや", "たいわんせいふ", "たいわんはげ", "たけのこいしゃ", "たこべや", "たたき", "だっちまん", "たまぶくろすじたろう", "たりきほんがん", 
        "たれながす", "ちえおくれ", "ちかめ", "ちすじ", "ちび", "ちほうしょう", "ちゃりんこ", "ちゃんころ", "ちゅうきょう", "ちょうせんせいばつ", 
        "ちょうせんにんじん", "ちょん", "ちんば", "つりがき", "つれご", "つんぼ", "つんぼさじき", "ていかいはつこく", "ていのう", "ていのうじ", 
        "でか", "でかせぎ", "でっち", "でもどり", "てんさいときょうじんはかみひとえ", "てんぼう", "どかた", "とくしゅがっきゅう", "とくしゅがっこう", "とくしゅぶらく", 
        "どけんや", "どこう", "とこや", "どざえもん", "とさつ", "とさつじょう", "とさつにん", "どさまわり", "どじん", "ともかせぎ", 
        "どもり", "どや", "どやがい", "とやまのさんすけ", "とるこじょう", "とるこぶろ", "どんびゃくしょう", "なおん", "なんせん", "なんぶのしゃけのはなまがり", 
        "にがー", "にぐろ", "にごう", "にこよん", "にほんのちべっと", "にんそく", "にんぴにん", "にんぷ", "ねこばば", "のうふ", 
        "のうまくえん", "のび", "はーふ", "ぱーまや", "ばかちょんかめら", "ばかでもちょんでも", "はくち", "ぱくる", "ばくろう", "はしため", 
        "はだいろ", "ばたや", "はっきょうする", "ばてい", "ぱんすけ", "ばんた", "はんとうじん", "はんば", "ひかれもの", "びっこ", 
        "ひにん", "ひも", "ひゃくしょう", "ひやとい", "ひんのう", "ぶおとこ", "ふかしょくみん", "ふぐ", "ふけい", "ふじのやまい", 
        "ぶす", "ぶたばこ", "ぶつ", "ふみきりばん", "ぶらいんどたっち", "ぶらく", "ふろうじ", "ふろうしゃ", "ぺいかん", "ぺいちゅう", 
        "ぼうず", "ほくせん", "ぽこぺん", "ほせんこうふ", "ぽっぽーや", "ほぼ", "ぽりこう", "ほんごしをいれる", "ぽんびき", "ほんぼし", 
        "まえつき", "まじょっこ", "またにかける", "まちいしゃ", "まんこ", "まんしゅう", "みかいじん", "みかいはつこく", "みつくち", "みぶん", 
        "みぼうじん", "みもとちょうさ", "むこをとる", "むすめをかたづける", "めいもんこう", "めかけ", "めくら", "めくらじま", "めくらばんをおす", "めくらへびにおじず", 
        "めくらめっぽう", "めっかち", "もうあいする", "もうこしょう", "もうじん", "もうもく", "もんもう", "やーさま", "やおや", "やくぶそく", 
        "やさぐれ", "やばい", "やぶいしゃ", "やぶにらみ", "やんきー", "やんきい", "ゆうびんふ", "ゆうびんや", "ようご", "ようろういん", 
        "よせば", "よつ", "よつあし", "よつつじ", "よめにやる", "よりめ", "らいびょう", "るんぺん", "れいじょう", "れんとげんぎし", 
        "ろうば", "ろうむしゃ", "ろすけ", "ろんぱり"
    ]
    inappropriate_words_k = [
        "アイヌ系", "合いの子", "青姦", "アカ", "明盲", "足切り", "足を洗う", "当て馬", "アメ公", "あらめん", 
        "アル中", "按摩", "家柄", "イカサマ", "躄", "伊勢乞食", "イタ公", "板前", "いちゃもん", "田舎", 
        "犬殺し", "移民", "イモ", "インチキ", "インディアン嘘つかない", "淫売", "裏日本", "うんこ", "運ちゃん", 
        "エスキモー", "穢多", "越後の米つき", "エチゼンクラゲ", "エディター", "ＯＬ", "オールドミス", "オカマ", 
        "沖仲仕", "唖", "落人部落", "落ちこぼれ", "落とし前", "溺れ死ぬ", "お巡り", "表日本", "親方", "おわいや", 
        "女子供", "女の腐ったような", "隠坊", "外人", "蛙の子は蛙", "ガキ", "確信犯", "拡張員", "拡張団", 
        "拡張団長", "家系", "過去帳", "ガサ", "かさっかき", "片足", "片親", "片手落ち", "片肺", "片目", 
        "片端", "がちゃ目", "担ぎ屋", "かったい", "がっぷり四つ", "カッペ", "上方の贅六", "借り腹", "皮被り", 
        "皮切り", "川向こう", "河原乞食", "看護婦", "姦通", "キ印", "キチ", "気違い", "気違い沙汰", "気違いに刃物", 
        "ぎっちょ", "給仕", "灸を据える", "狂気", "狂気の沙汰", "狂女", "狂人", "漁夫", "苦力", "屑屋", 
        "愚鈍", "首切り", "汲み取り屋", "狂う", "クロ", "黒んぼ", "くわえ込む", "クンニ", "群盲象をなでる", "芸人", 
        "ゲーセン", "下女", "血統", "毛唐", "下男", "健全なる精神は健全なる身体に宿る", "ゲンナマ", "強姦", "後進国", "興信所", 
        "業病", "鉱夫", "工夫", "坑夫", "紅毛人", "黒人", "虚仮", "孤児院", "乞食", "小僧", 
        "小使い", "子供", "小人", "ゴミ屋", "コロシ", "魚屋", "ザギン", "サツ", "サラ金", "サラブレッド", 
        "三韓征伐", "三国人", "三助", "産婆", "色盲", "支那", "支那人", "支那蕎麦", "支那竹", "支那料理", 
        "士農工商", "ジプシー", "自閉症児", "シマ", "地回り", "ジャップ", "ジャリ", "ジュー", "獣医", "周旋屋", 
        "酋長", "嬢", "障害者", "将棋倒しになる", "情夫", "情婦", "女給", "植物人間", "女傑", "女工", 
        "助産婦", "処女作", "処女峰", "女中", "職工", "しらっこ", "尻拭い", "心障児", "心障者", "新平民", 
        "ズージャー", "スケ", "すけこまし", "スチュワーデス", "滑り止め", "ずらかる", "スラム", "正妻", "精神異常", "精神分裂病", 
        "精薄", "傴僂", "鮮人", "潜水夫", "千摺り", "線路工夫", "掃除婦", "掃除夫", "雑役夫", "育ちより氏",
    ]
    #sex = read_lines_from_txt("./dicts/Sexual.txt")
    #sexbopo = read_lines_from_txt("./dicts/Sexual_bopo.txt")
    #sexmask = read_lines_from_txt("./dicts/Sexual_mask.txt")
    #bopo = read_lines_from_txt("./dicts/bopo.txt")
    #Offense = read_lines_from_txt("./dicts/Offense.txt")
    #combined_list = inappropriate_words_h + inappropriate_words_k + sex + sexbopo + sexmask + bopo + Offense
    combined_list = inappropriate_words_h + inappropriate_words_k
    pattern = re.compile("|".join(map(re.escape, combined_list)))
    return pattern.sub("*", text)

def contains_inappropriate_words(text, inappropriate_words):
    pattern = re.compile("|".join(map(re.escape, inappropriate_words)))
    return bool(pattern.search(text))


def checknsfw(words):
    inappropriate_words_h = [
        "あいぬけい", "あいのこ", "あおかん", "あか", "あきめくら", "あしきり", "あしをあらう", "あてうま", "あめこう", "あらめん", 
        "あるちゅう", "あんま", "いえがら", "いかさま", "いざり", "いせこじき", "いたこう", "いたまえ", "いちゃもん", "いなか", 
        "いぬごろし", "いみん", "いも", "いんちき", "いんでぃあんうそつかない", "いんばい", "うらにほん", "うんこ", "うんちゃん", 
        "えすきもー", "えた", "えちごのこめつき", "えちぜんくらげ", "えでぃたー", "おーえる", "おーるどみす", "おかま", 
        "おきなかし", "おし", "おちうどぶらく", "おちこぼれ", "おとしまえ", "おぼれじぬ", "おまわり", "おもてにほん", "おやかた", "おわいや", 
        "おんなこども", "おんなのくさったような", "おんぼう", "がいじん", "かえるのこはかえる", "がき", "かくしんはん", "かくちょういん", "かくちょうだん", 
        "かくちょうだんちょう", "かけい", "かこちょう", "がさ", "かさっかき", "かたあし", "かたおや", "かたておち", "かたはい", "かため", 
        "かたわ", "がちゃめ", "かつぎや", "かったい", "がっぷりよつ", "かっぺ", "かみがたのぜいろく", "かりばら", "かわかぶり", 
        "かわきり", "かわむこう", "かわらこじき", "かんごふ", "かんつう", "きじるし", "きち", "きちがい", "きちがいざた", "きちがいにはもの", 
        "ぎっちょ", "きゅうじ", "きゅうをすえる", "きょうき", "きょうきのさた", "きょうじょ", "きょうじん", "ぎょふ", "くーりー", "くずや", 
        "ぐどん", "くびきり", "くみとりや", "くるう", "くろ", "くろんぼ", "くわえこむ", "くんに", "ぐんもうぞうをなでる", "げいにん", 
        "げーせん", "げじょ", "けっとう", "けとう", "げなん", "けんぜんなるせいしんはけんぜんなるしんたいにやどる", "げんなま", "ごうかん", "こうしんこく", "こうしんじょ", 
        "ごうびょう", "こうふ", "こうふ", "こうふ", "こうもうじん", "こくじん", "こけ", "こじいん", "こじき", "こぞう", 
        "こづかい", "こども", "こびと", "ごみや", "ころし", "さかなや", "ざぎん", "さつ", "さらきん", "さらぶれっど", 
        "さんかんせいばつ", "さんごくじん", "さんすけ", "さんば", "しきもう", "しな", "しなじん", "しなそば", "しなちく", "しなりょうり", 
        "しのうこうしょう", "じぷしー", "じへいしょうじ", "しま", "じまわり", "じゃっぷ", "じゃり", "じゅー", "じゅうい", "しゅうせんや", 
        "しゅうちょう", "じょう", "しょうがいしゃ", "しょうぎだおしになる", "じょうふ", "じょうふ", "じょきゅう", "しょくぶつにんげん", "じょけつ", "じょこう", 
        "じょさんぷ", "しょじょさく", "しょじょほう", "じょちゅう", "しょっこう", "しらっこ", "しりぬぐい", "しんしょうじ", "しんしょうしゃ", "しんへいみん", 
        "ずーじゃー", "すけ", "すけこまし", "すちゅわーです", "すべりどめ", "ずらかる", "すらむ", "せいさい", "せいしんいじょう", "せいしんぶんれつびょう", 
        "せいはく", "せむし", "せんじん", "せんすいふ", "せんずり", "せんろこうふ", "そうじふ", "そうじふ", "ぞうやくふ", "そだちよりうじ", 
        "だいさんごく", "だいしょや", "たいわんせいふ", "たいわんはげ", "たけのこいしゃ", "たこべや", "たたき", "だっちまん", "たまぶくろすじたろう", "たりきほんがん", 
        "たれながす", "ちえおくれ", "ちかめ", "ちすじ", "ちび", "ちほうしょう", "ちゃりんこ", "ちゃんころ", "ちゅうきょう", "ちょうせんせいばつ", 
        "ちょうせんにんじん", "ちょん", "ちんば", "つりがき", "つれご", "つんぼ", "つんぼさじき", "ていかいはつこく", "ていのう", "ていのうじ", 
        "でか", "でかせぎ", "でっち", "でもどり", "てんさいときょうじんはかみひとえ", "てんぼう", "どかた", "とくしゅがっきゅう", "とくしゅがっこう", "とくしゅぶらく", 
        "どけんや", "どこう", "とこや", "どざえもん", "とさつ", "とさつじょう", "とさつにん", "どさまわり", "どじん", "ともかせぎ", 
        "どもり", "どや", "どやがい", "とやまのさんすけ", "とるこじょう", "とるこぶろ", "どんびゃくしょう", "なおん", "なんせん", "なんぶのしゃけのはなまがり", 
        "にがー", "にぐろ", "にごう", "にこよん", "にほんのちべっと", "にんそく", "にんぴにん", "にんぷ", "ねこばば", "のうふ", 
        "のうまくえん", "のび", "はーふ", "ぱーまや", "ばかちょんかめら", "ばかでもちょんでも", "はくち", "ぱくる", "ばくろう", "はしため", 
        "はだいろ", "ばたや", "はっきょうする", "ばてい", "ぱんすけ", "ばんた", "はんとうじん", "はんば", "ひかれもの", "びっこ", 
        "ひにん", "ひも", "ひゃくしょう", "ひやとい", "ひんのう", "ぶおとこ", "ふかしょくみん", "ふぐ", "ふけい", "ふじのやまい", 
        "ぶす", "ぶたばこ", "ぶつ", "ふみきりばん", "ぶらいんどたっち", "ぶらく", "ふろうじ", "ふろうしゃ", "ぺいかん", "ぺいちゅう", 
        "ぼうず", "ほくせん", "ぽこぺん", "ほせんこうふ", "ぽっぽーや", "ほぼ", "ぽりこう", "ほんごしをいれる", "ぽんびき", "ほんぼし", 
        "まえつき", "まじょっこ", "またにかける", "まちいしゃ", "まんこ", "まんしゅう", "みかいじん", "みかいはつこく", "みつくち", "みぶん", 
        "みぼうじん", "みもとちょうさ", "むこをとる", "むすめをかたづける", "めいもんこう", "めかけ", "めくら", "めくらじま", "めくらばんをおす", "めくらへびにおじず", 
        "めくらめっぽう", "めっかち", "もうあいする", "もうこしょう", "もうじん", "もうもく", "もんもう", "やーさま", "やおや", "やくぶそく", 
        "やさぐれ", "やばい", "やぶいしゃ", "やぶにらみ", "やんきー", "やんきい", "ゆうびんふ", "ゆうびんや", "ようご", "ようろういん", 
        "よせば", "よつ", "よつあし", "よつつじ", "よめにやる", "よりめ", "らいびょう", "るんぺん", "れいじょう", "れんとげんぎし", 
        "ろうば", "ろうむしゃ", "ろすけ", "ろんぱり"
    ]
    inappropriate_words_k = [
        "アイヌ系", "合いの子", "青姦", "アカ", "明盲", "足切り", "足を洗う", "当て馬", "アメ公", "あらめん", 
        "アル中", "按摩", "家柄", "イカサマ", "躄", "伊勢乞食", "イタ公", "板前", "いちゃもん", "田舎", 
        "犬殺し", "移民", "イモ", "インチキ", "インディアン嘘つかない", "淫売", "裏日本", "うんこ", "運ちゃん", 
        "エスキモー", "穢多", "越後の米つき", "エチゼンクラゲ", "エディター", "ＯＬ", "オールドミス", "オカマ", 
        "沖仲仕", "唖", "落人部落", "落ちこぼれ", "落とし前", "溺れ死ぬ", "お巡り", "表日本", "親方", "おわいや", 
        "女子供", "女の腐ったような", "隠坊", "外人", "蛙の子は蛙", "ガキ", "確信犯", "拡張員", "拡張団", 
        "拡張団長", "家系", "過去帳", "ガサ", "かさっかき", "片足", "片親", "片手落ち", "片肺", "片目", 
        "片端", "がちゃ目", "担ぎ屋", "かったい", "がっぷり四つ", "カッペ", "上方の贅六", "借り腹", "皮被り", 
        "皮切り", "川向こう", "河原乞食", "看護婦", "姦通", "キ印", "キチ", "気違い", "気違い沙汰", "気違いに刃物", 
        "ぎっちょ", "給仕", "灸を据える", "狂気", "狂気の沙汰", "狂女", "狂人", "漁夫", "苦力", "屑屋", 
        "愚鈍", "首切り", "汲み取り屋", "狂う", "クロ", "黒んぼ", "くわえ込む", "クンニ", "群盲象をなでる", "芸人", 
        "ゲーセン", "下女", "血統", "毛唐", "下男", "健全なる精神は健全なる身体に宿る", "ゲンナマ", "強姦", "後進国", "興信所", 
        "業病", "鉱夫", "工夫", "坑夫", "紅毛人", "黒人", "虚仮", "孤児院", "乞食", "小僧", 
        "小使い", "子供", "小人", "ゴミ屋", "コロシ", "魚屋", "ザギン", "サツ", "サラ金", "サラブレッド", 
        "三韓征伐", "三国人", "三助", "産婆", "色盲", "支那", "支那人", "支那蕎麦", "支那竹", "支那料理", 
        "士農工商", "ジプシー", "自閉症児", "シマ", "地回り", "ジャップ", "ジャリ", "ジュー", "獣医", "周旋屋", 
        "酋長", "嬢", "障害者", "将棋倒しになる", "情夫", "情婦", "女給", "植物人間", "女傑", "女工", 
        "助産婦", "処女作", "処女峰", "女中", "職工", "しらっこ", "尻拭い", "心障児", "心障者", "新平民", 
        "ズージャー", "スケ", "すけこまし", "スチュワーデス", "滑り止め", "ずらかる", "スラム", "正妻", "精神異常", "精神分裂病", 
        "精薄", "傴僂", "鮮人", "潜水夫", "千摺り", "線路工夫", "掃除婦", "掃除夫", "雑役夫", "育ちより氏",
    ]
    #sex = read_lines_from_txt("./dicts/Sexual.txt")
    #sexbopo = read_lines_from_txt("./dicts/Sexual_bopo.txt")
    #sexmask = read_lines_from_txt("./dicts/Sexual_mask.txt")
    #bopo = read_lines_from_txt("./dicts/bopo.txt")
    #Offense = read_lines_from_txt("./dicts/Offense.txt")
    #combined_list = inappropriate_words_h + inappropriate_words_k + sex + sexbopo + sexmask + bopo + Offense
    combined_list = inappropriate_words_h + inappropriate_words_k
    return contains_inappropriate_words(words,combined_list)
def read_lines_from_txt(file_path):
        lines = []
        with open(file_path, 'r', encoding='utf-8') as file:
            for line in file:
                lines.append(line.strip())
        return lines

def getTWvideo(URL):
    t = f"https://twidropper.com/request?action=add&url={URL}"
    return requests.get(t).json()

def create_othello_board():
    board = [
        [0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 1, -1, 0, 0, 0],
        [0, 0, 0, -1, 1, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0]
    ]
    return board

def create_playable_othello_flex_message(board):
    header_contents = [
        {"type": "text", "text": "オセロゲーム", "weight": "bold", "size": "xl"}
    ]
    body_contents = []
    for i in range(8):
        row_contents = []
        for j in range(8):
            background_color = "#00FF00" if board[i][j] == 0 else "#000000" if board[i][j] == 1 else "#FFFFFF"
            label = "●" if board[i][j] == 1 else "○" if board[i][j] == -1 else " "
            button = {
                "type": "button",
                "action": {"type": "postback", "label": label, "data": f"move {i} {j}"},
                "color": "#FFFFFF",
                "height": "sm",
                "style": "primary",
                "gravity": "center"
            }
            row_contents.append({
                "type": "box",
                "layout": "vertical",
                "contents": [button],
                "backgroundColor": background_color
            })
        body_contents.append({"type": "box", "layout": "horizontal", "contents": row_contents, "spacing": "md"})
    
    flex_message = {
        "type": "bubble",
        "header": {"type": "box", "layout": "vertical", "contents": header_contents},
        "body": {"type": "box", "layout": "vertical", "contents": body_contents, "spacing": "md"}
    }
    return flex_message



app = Flask(__name__)
token = '/07/lu+hbA3W8CWnXpOEJ0d5KinfqH51vSPIC6wX2CdzDc9QLOy85cS+GRoqbeaLvWYnk+c15uc14mxx0BM3UrRK073jA9g/nvDLadVqRblahrzCGxrbdSs1tTho9V+zEP5caL0emkqHB7NmVb7QjQdB04t89/1O/w1cDnyilFU='
configuration = Configuration(access_token='/07/lu+hbA3W8CWnXpOEJ0d5KinfqH51vSPIC6wX2CdzDc9QLOy85cS+GRoqbeaLvWYnk+c15uc14mxx0BM3UrRK073jA9g/nvDLadVqRblahrzCGxrbdSs1tTho9V+zEP5caL0emkqHB7NmVb7QjQdB04t89/1O/w1cDnyilFU=')
handler = WebhookHandler('a555d82dacf40144c6480580ec728a21')

#cl = CHRLINE("u8c3c21d9e5dfd137b196882adb4408cd:aWF0OiAxMDA2OTUwMjE5NjAK..V2QpW24jSGogN/H5p9k8WCWr1Xk=",device="ANDROID",useThrift=True)

status = livejson.File('data.json', True, False, 4)
lvdata = livejson.File('lv.json', True, False, 4)
slot = livejson.File('slot.json', True, False, 4)
unsend = livejson.File('unsend.json', True, False, 4)
msgdata = livejson.File('msgdata.json', True, False, 4)
groupmember = livejson.File('memberlist.json', True, False, 4)

NG = ["エックスビデオ","sex","Sex","sEx","SEx","SEX","SeX","sEx","xvideos","porn","pornhub","セックス","せっくす","死ね","しね","4ね","しねよ","首吊り","自殺","他殺","殺","殺害","交通事故","https://","http://","殺すぞ",".com","f5.si",".net",".co","duckduckgo","google.com"]

ngrokURL = ""

helpmessage = """使い方
ヘルプ
>> これ
テスト
>> 動作確認
ランキング
>> 自分の浮上率レベルを出します
追加:[反応ワード]:[返答]
>> 反応ワードを追加します
削除:[反応ワード]
>> 反応ワードを削除します
ワード一覧
>> 反応ワード一覧を表示させます
leave
>> 退会します
参加挨拶設定
>> 参加挨拶の設定をします
チンチロ
>> チンチロゲームをします(近日公開予定)"""

def show_and_get_result(TF):
    if TF == False:
        REEL_MARK_LIST = ('7', 'BAR', '🍒', '🍎', 'Reply','♢','♢', 'Reply', '🍎','Reply','♢','Reply','🍎')
        result_list = []
        for _ in range(3):
            index = random.randint(0, 12)
            result = REEL_MARK_LIST[index]
            result_list.append(result)
        result_all = ''.join(result_list)
        return result_all
    if TF == True:
        REEL_MARK_LIST = ('7', '🍎', '7','7','7', '7', '7','7','7','7','🍎','🍎','7')
        result_list = []
        for _ in range(3):
            index = random.randint(0, 12)
            result = REEL_MARK_LIST[index]
            result_list.append(result)
        result_all = ''.join(result_list)
        return result_all
    else:
        pass

def slotgame(UserId):
    if slot[UserId]["BB"] == False:
        if 3 < slot[UserId]["credit"]:
            marks = show_and_get_result(False)
            slot[UserId]["credit"] -= 3
            if marks == '777':
                slot[UserId]["credit"] +=350
                slot[UserId]["BB"] = True
                slot[UserId]["BBnum"] = random.choice([3,6,9,12,15,18,21,30])
                return "7/7/7 150クレジット獲得[GoGo]"
            elif marks == 'BARBARBAR':
                slot[UserId]["credit"] +=60
                return "BAR/BAR/BAR 60クレジット獲得"
            elif marks == '🍎🍎🍎':
                slot[UserId]["credit"] += 40
                return "🍎/🍎/🍎 40クレジット獲得"
            elif marks == 'ReplyReplyReply':
                return "Reply/Reply/Reply もっかい引けるよ"
            elif marks is not None and marks[0:1] == '🍒':
                slot[UserId]["credit"] += 20
                return f"{marks} 20クレジット獲得"
            else:
                return f"{marks} はずれ"
        else:
            return "3クレジット以上ないとスロットを回せません"
    elif slot[UserId]["BB"] == True:
        if 3 < slot[UserId]["credit"]:
            marks = show_and_get_result(True)
            slot[UserId]["credit"] -= 3
            slot[UserId]["BBnum"] -= 1
            if not slot[UserId]["BBnum"] == 0:
                if marks == '777':
                    slot[UserId]["credit"] +=350
                    return "7/7/7 350クレジット獲得[BB]"
                elif marks == '🍎🍎🍎':
                    slot[UserId]["credit"] += 40
                    return "🍎/🍎/🍎 120クレジット獲得[BB]"
                else:
                    return f"{marks} はずれ[BB]"
            else:
                slot[UserId]["BB"] = False
                marks = show_and_get_result(False)
                if marks == '777':
                    slot[UserId]["credit"] +=350
                    slot[UserId]["BB"] = True
                    slot[UserId]["BBnum"] = random.choice(["3","6","9","12","15","18","21","30"])
                    return "7/7/7 150クレジット獲得[GoGo]"
                elif marks == 'BARBARBAR':
                    slot[UserId]["credit"] +=60
                    return "BAR/BAR/BAR 60クレジット獲得"
                elif marks == '🍎🍎🍎':
                    slot[UserId]["credit"] += 40
                    return "🍎/🍎/🍎 40クレジット獲得"
                elif marks == 'ReplyReplyReply':
                    return "Reply/Reply/Reply もっかい引けるよ"
                elif marks is not None and marks[0:1] == '🍒':
                    slot[UserId]["credit"] += 20
                    return f"{marks} 20クレジット獲得"
                else:
                    return f"{marks} はずれ"
        else:
            return "3クレジット以上ないとスロットを回せません"
def youtubeSearch(word,limit):
    base = {
  "type": "carousel",
  "contents": []
}
    result = Search(word, limit = limit).result()['result']
    print(len(result))
    ct = 0
    for data in result:
        if ct == 11:
            break
        if data['type'] == 'video':
            ct += 1
            flat = {
      "type": "bubble",
      "hero": {
        "type": "image",
        "url": data['thumbnails'][0]['url'],
        "size": "full",
        "action": {
          "type": "uri",
          "label": "URL",
          "uri": f"https://www.youtube.com/watch?v={data['id']}"
        }
      },
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "text",
            "text": data['channel']['name'],
            "weight": "bold",
            "wrap": True,
            "align": "center"
          },
          {
            "type": "text",
            "wrap": True,
            "text": data["title"]
          }
        ]
      },
      "footer": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "text",
            "text": "©2024 moyashi bot",
            "size": "sm",
            "weight": "bold",
            "align": "center"
          }
        ],
        "backgroundColor": "#7FCCE3"
      }
    }
            base["contents"].append(flat)
    return base

flex_helpmessage = {
  "type": "carousel",
  "contents": [
    {
      "type": "bubble",
      "header": {
        "type": "box",
        "layout": "horizontal",
        "contents": [
          {
            "type": "text",
            "text": "使い方一覧",
            "weight": "bold",
            "size": "lg",
            "margin": "md",
            "align": "start"
          }
        ]
      },
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "自分のランキング",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "ランキング"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          },
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "反応ワード一覧",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "ワード一覧"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          },
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "スロット",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "スロットhelp"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          },
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "参加挨拶設定",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "参加挨拶設定"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          },
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "反応ワード追加",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "反応ワード追加"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          },
          {
            "type": "box",
            "layout": "horizontal",
            "contents": [
              {
                "type": "text",
                "text": "おみくじ",
                "size": "md",
                "color": "#000000",
                "flex": 1,
                "weight": "bold",
                "margin": "none"
              },
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "表示",
                  "text": "おみくじ"
                },
                "height": "sm",
                "flex": 0,
                "margin": "lg",
                "offsetTop": "xs",
                "offsetStart": "md",
                "offsetEnd": "xxl",
                "offsetBottom": "xxl"
              }
            ]
          }
        ]
      },
      "footer": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "text",
            "text": "©2024 moyashi bot",
            "flex": 0,
            "size": "sm",
            "align": "center",
            "margin": "xs",
            "weight": "bold"
          }
        ],
        "backgroundColor": "#7FCCE3",
        "flex": 0
      },
      "styles": {
        "footer": {
          "separator": True
        }
      }
    },
    {
      "type": "bubble",
      "header": {
        "type": "box",
        "layout": "horizontal",
        "contents": [
          {
            "type": "text",
            "text": "使い方一覧2",
            "weight": "bold",
            "size": "lg",
            "margin": "md",
            "align": "start"
          }
        ]
      },
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "box",
                "layout": "horizontal",
                "contents": [
                  {
                    "type": "text",
                    "text": "反応ワード削除",
                    "size": "md",
                    "color": "#000000",
                    "flex": 1,
                    "weight": "bold",
                    "margin": "none",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "反応ワード削除"
                    }
                  },
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "反応ワード削除"
                    },
                    "height": "sm",
                    "flex": 0,
                    "margin": "lg",
                    "offsetTop": "xs",
                    "offsetStart": "md",
                    "offsetEnd": "xxl",
                    "offsetBottom": "xxl"
                  }
                ]
              },
              {
                "type": "box",
                "layout": "horizontal",
                "contents": [
                  {
                    "type": "text",
                    "text": "ランダム反応ワード追加",
                    "size": "md",
                    "color": "#000000",
                    "flex": 1,
                    "weight": "bold",
                    "margin": "none",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "ランダム反応ワード追加"
                    }
                  },
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "ランダム反応ワード追加"
                    },
                    "height": "sm",
                    "flex": 0,
                    "margin": "lg",
                    "offsetTop": "xs",
                    "offsetStart": "md",
                    "offsetEnd": "xxl",
                    "offsetBottom": "xxl"
                  }
                ]
              },
              {
                "type": "box",
                "layout": "horizontal",
                "contents": [
                  {
                    "type": "text",
                    "text": "ランダム反応ワード削除",
                    "size": "md",
                    "color": "#000000",
                    "flex": 1,
                    "weight": "bold",
                    "margin": "none",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "ランダム反応ワード削除"
                    }
                  },
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "ランダム反応ワード削除"
                    },
                    "height": "sm",
                    "flex": 0,
                    "margin": "lg",
                    "offsetTop": "xs",
                    "offsetStart": "md",
                    "offsetEnd": "xxl",
                    "offsetBottom": "xxl"
                  }
                ]
              },
              {
                "type": "box",
                "layout": "horizontal",
                "contents": [
                  {
                    "type": "text",
                    "text": "youtube動画検索",
                    "size": "md",
                    "color": "#000000",
                    "flex": 1,
                    "weight": "bold",
                    "margin": "none",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "youtube動画検索"
                    }
                  },
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "表示",
                      "text": "youtube動画検索"
                    },
                    "height": "sm",
                    "flex": 0,
                    "margin": "lg",
                    "offsetTop": "xs",
                    "offsetStart": "md",
                    "offsetEnd": "xxl",
                    "offsetBottom": "xxl"
                  }
                ]
              }
            ]
          }
        ]
      },
      "footer": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "text",
            "text": "©2024 moyashi bot",
            "flex": 0,
            "size": "sm",
            "align": "center",
            "margin": "xs",
            "weight": "bold"
          }
        ],
        "backgroundColor": "#7FCCE3",
        "flex": 0
      }
    }
  ]
}


def makeQR(text):
    img = qrcode.make(text)
    img.save('./qr.png')

def send_flex_profile(token, gid, sender):
    res = json.loads(get_profile(token,gid,sender))
    json_data = {
            "type": "bubble", 
            "header": {
                "type": "box", 
                "layout": "horizontal", 
                "contents": [
                    {
                        "type": "image", 
                        "url": f"{res['pictureUrl']}", 
                        "align": "center", 
                        "backgroundColor": "#7FCCE3", 
                        "margin": "none"
                    }, 
                    {
                        "type": "text", 
                        "text": f"{res['displayName']}", 
                        "weight": "bold", 
                        "size": "lg", 
                        "margin": "md", 
                        "align": "start"
                    }
                ]
            }, 
            "body": {
                "type": "box", 
                "layout": "vertical", 
                "contents": [
                    {
                        "type": "box", 
                        "layout": "horizontal", 
                        "contents": [
                            {
                                "type": "text", 
                                "text": "レベル", 
                                "size": "md", 
                                "color": "#008000", 
                                "flex": 2, 
                                "weight": "bold"
                            }, 
                            {
                                "type": "text", 
                                "text": f"{lvdata['lv'][sender]}", 
                                "size": "md", 
                                "color": "#111111", 
                                "align": "end", 
                                "flex": 4, 
                                "weight": "bold"
                            }
                        ]
                    }, 
                    {
                        "type": "box", 
                        "layout": "horizontal", 
                        "contents": [
                            {
                                "type": "text", 
                                "text": "経験値", 
                                "size": "md", 
                                "color": "#008000", 
                                "flex": 2, 
                                "weight": "bold"
                            }, 
                            {
                                "type": "text", 
                                "text": f"{lvdata['xp'][sender]} / 100", 
                                "size": "md", 
                                "color": "#111111", 
                                "align": "end", 
                                "flex": 4, 
                                "weight": "bold"
                            }
                        ]
                    }
                ]
            }, 
            "footer": {
                "type": "box", 
                "layout": "vertical", 
                "contents": [
                    {
                        "type": "text", 
                        "text": "©2024 moyashi bot", 
                        "flex": 0, 
                        "size": "sm", 
                        "align": "center", 
                        "margin": "xs", 
                        "weight": "bold"
                    }
                ], 
                "backgroundColor": "#7FCCE3", 
                "flex": 0
            }, 
            "styles": {
                "footer": {
                    "separator": True
                }
            }
        }
    return json_data

def sessionfunc(op,client):
    type = status["session"][op.source.user_id]["type"]
    if type == "greeting":
        NGTF = NgWordSystem.detect(op.message.text)
        if NGTF == False:
            gid = op.source.group_id
            status["gred"][gid] = op.message.text
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"誰かが参加したときに「{op.message.text}」と送信します")]))
            del status["session"][op.source.user_id]
        else:
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="禁止ワードが含まれています")]))
            del status["session"][op.source.user_id]
    elif type == "leaving":
        gid = op.source.group_id
        status["leav"][gid] = op.message.text
        client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"None")]))
        del status["session"][op.source.user_id]
    elif type == "addreact":
        gid = op.source.group_id
        del status["session"][op.source.user_id]
        if not op.message.text in status["group"][gid]:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"反応ワードを追加しました\n続いてそのメッセージが送信されたときに返信するメッセージを送ってください")]))
        else:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="既にそのワードは登録されています")]))
        status["session"][op.source.user_id] = {}
        status["session"][op.source.user_id]["type"] = "s_addreact"
        status["session"][op.source.user_id]["description"] = op.message.text
    elif type == "s_addreact":
        gid = op.source.group_id
        NGTF = NgWordSystem.detect(op.message.text)
        if  NGTF == False:
                status["group"][gid][status["session"][op.source.user_id]["description"]] = {"text":op.message.text,"UserId":op.source.user_id}
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="反応ワードを追加しました")]))
        else:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="禁止ワードです")]))
        del status["session"][op.source.user_id]
    elif type == "delreact":
        gid = op.source.group_id
        if op.message.text in status["group"][gid]:
            del status["group"][gid][op.message.text]
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"反応ワードから削除しました")]))
            del status["session"][op.source.user_id]
        else:
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"その反応ワードは登録されていません")]))
            del status["session"][op.source.user_id]

    elif type == "r_addreact":
        gid = op.source.group_id
        del status["session"][op.source.user_id]
        NGTF = NgWordSystem.detect(op.message.text)
        if not op.message.text in status["group"][gid] and NGTF == False:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"ランダム反応ワードを追加しました\n続いてそのメッセージが送信されたときに返信するメッセージを送ってください")]))
        else:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="既にそのワードは登録されています")]))
        status["session"][op.source.user_id] = {}
        status["session"][op.source.user_id]["type"] = "rs_addreact"
        status["session"][op.source.user_id]["description"] = op.message.text
    elif type == "rs_addreact":
        gid = op.source.group_id
        NGTF = NgWordSystem.detect(op.message.text)
        if NGTF == False:
                status["group"][gid][status["session"][op.source.user_id]["description"]] = {"text":op.message.text,"UserId":"RANDOM"}
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ランダム反応ワードを追加しました")]))
        else:
                client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="禁止ワードがふくまれています")]))
        del status["session"][op.source.user_id]
    elif type == "r_delreact":
        gid = op.source.group_id
        if op.message.text in status["group"][gid]:
            del status["group"][gid][op.message.text]
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"をランダム反応ワードから削除しました")]))
            del status["session"][op.source.user_id]
        else:
            client.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"ランダム反応ワードに登録されてないか、禁止ワードです")]))
            del status["session"][op.source.user_id]
    elif type == "ytsearch":
            receiveData = youtubeSearch(op.message.text,10)
            client.reply_message_with_http_info(
                ReplyMessageRequest(
                    replyToken=op.reply_token,
                    messages=[
                        FlexMessage(
                            altText="result",
                            contents=FlexContainer.from_dict(receiveData),
                            quickReply=None,
                        )
                    ],
                    notificationDisabled=None,
                )
                )
            del status["session"][op.source.user_id]
    else:
        pass

def load_audio_file(file_path):
    """
    音声ファイルを読み込む関数
    """
    recognizer = sr.Recognizer()
    with sr.AudioFile(file_path) as source:
        audio_data = recognizer.record(source)
    return audio_data

def transcribe_audio(audio_data):
    """
    音声データをテキストに変換する関数
    """
    recognizer = sr.Recognizer()
    try:
        text = recognizer.recognize_google(audio_data, language='ja-JP')
    except sr.UnknownValueError:
        return "音声を認識できませんでした。"
    except sr.RequestError:
        return "APIリクエストに失敗しました。"
    return text

@app.route('/')
def index():
    return 'Hallow Warld!'

@app.route("/callback", methods=['POST'])
def callback():
    signature = request.headers['X-Line-Signature']
    body = request.get_data(as_text=True)
    app.logger.info("Request body: " + body)
    try:
        handler.handle(body, signature)
    except InvalidSignatureError:
        app.logger.info("Invalid signature. Please check your channel access token/channel secret.")
        abort(400)

    return 'OK'




@handler.add(MessageEvent, message=TextMessageContent)
def handle_message(op: MessageEvent) -> None:
    with ApiClient(configuration) as api_client:
         chatType = op.source.type #group == group
         try:
             gid = op.source.group_id
         except:
             gid = "None"
         sender = op.source.user_id
         msgtype = op.message.type
         msgid = op.message.id
         text = op.message.text 
         mentionees = op.message.mention
         if not gid in groupmember:
             groupmember[gid] = []
         else:
             pass
         if not sender in groupmember[gid]:
             groupmember[gid].append(sender)
         if not gid in msgdata:
            msgdata[gid] = {}
            msgdata[gid][msgid] = text
         else:
            msgdata[gid][msgid] = text
         if not gid in lvdata["group"]:
            lvdata["group"][gid] = []
         if not sender in lvdata["group"][gid]:
            lvdata["group"][gid].append(sender)
         if not gid in status["group"]:
             status["group"][gid] = {}
         line_bot_api = MessagingApi(api_client)
         if sender in status["session"]:
            sessionfunc(op,line_bot_api)
         if text == "反応ワード全削除":
            if sender in status["admin"]:
                status["group"][gid] = {}
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="success")]))
         if text == "セッション全削除":
            if sender in status["admin"]:
                status["session"] = {}
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="success")]))
         if text == "getdata:on":
            if sender in status["admin"]:
                try:
                    status["getdata"].append(gid)
                except:
                    status["getdata"] = []
                    status["getdata"].append(gid)
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ok")]))
         if text == "getdata:off":
            if sender in status["admin"]:
                try:
                    status["getdata"].remove(gid)
                except:
                    status["getdata"] = []
                    status["getdata"].remove(gid)
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ok")]))
         if text == "view":
            if sender in status["admin"]:
                lis = "保存ファイルリスト"
                files = glob.glob(f"./datas/{gid}/*")
                for file in files:
                    file = file.replace(f"./datas/{gid}/","")
                    lis += f"\n・{file}"
                lis += f"\n合計{len(files)}個の画像や動画"
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=lis)]))
         if text == "退会メッセージ登録":
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="この機能ミスってつけただけです")]))
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="退会メッセージに設定したいワードを送信してください")]))
            #status["session"][sender] = {}
            #status["session"][sender]["type"] = "leaving"
         if text == "参加挨拶登録":
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="この機能は現在この機能はご利用いただくことができません")]))
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="参加挨拶に設定したいワードを送信してください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "greeting"
         if text == "反応ワード追加":
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="現在この機能はご利用いただくことができません")]))
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="反応ワードに設定したいワードを送信してください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "addreact"
         if text == "反応ワード削除":
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="現在この機能はご利用いただくことができません")]))
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="反応ワードから削除したいワードを送信してください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "delreact"
         if text == "ランダム反応ワード追加":
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="現在この機能はご利用いただくことができません")]))
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ランダム反応ワードに設定したいワードを送信してください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "r_addreact"
         if text == "ランダム反応ワード削除":
            #line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="現在この機能はご利用いただくことができません")]))
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ランダム反応ワードから削除したいワードを送信してください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "r_delreact"
         if text == "youtube動画検索":
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="検索ワードを送ってください")]))
            status["session"][sender] = {}
            status["session"][sender]["type"] = "ytsearch"
         if text == "テスト" or text == "てすと" or text == "test":
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="うごいてるよ")]))
         if text == "ヘルプ" or text == "へるぷ" or text == "help":
            line_bot_api.reply_message_with_http_info(
            ReplyMessageRequest(
                replyToken=op.reply_token,
                messages=[
                    FlexMessage(
                        altText="ヘルプメッセージ",
                        contents=FlexContainer.from_dict(flex_helpmessage),
                        quickReply=None,
                    )
                ],
                notificationDisabled=None,
            )
            )
         if text == "rank" or text == "ランキング" or text == "プロフィール" or text == "プロフ" or text == "らんく" or text == "らんきんぐ" or text == "ぷろふ" or text == "ぷろふぃーる" or text == "すてーたす" or text == "ステータス" or text == "status" or text == "Status" or text == "Rank":
            p = json.loads(get_profile(token,gid,sender))['displayName']
            jsondata = send_flex_profile(token,gid,sender)
            res = line_bot_api.reply_message_with_http_info(
            ReplyMessageRequest(
                replyToken=op.reply_token,
                messages=[
                    FlexMessage(
                        altText=f"ランキング",
                        contents=FlexContainer.from_dict(jsondata),
                        quickReply=None,
                    )
                ],
                notificationDisabled=None,
            )
            )
         if text == "gid":
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=gid)]))
         if text == "uid":
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=sender)]))
         if text == "反応ワード一覧" or text == "反応ワード" or text == "ワード一覧":
            re = "反応ワード一覧\n"
            f = 0
            if not status["group"][gid] == {}:
                for a in status["group"][gid]:
                    if f == 0:
                        if status['group'][gid][a]['UserId'] == "RANDOM":
                            re = re + f"\n反応: {a}"
                            re = re + f"\n返答: {status['group'][gid][a]['text']} * RANDOM\n"
                        else:
                            re = re + f"\n反応: {a}"
                            re = re + f"\n返答: {status['group'][gid][a]['text']}\n"
                    else:
                        if status['group'][gid][a]['UserId'] == "RANDOM":
                            re = re + f"-----------------\n反応: {a}"
                            re = re + f"\n返答: {status['group'][gid][a]['text']} * RANDOM"
                        else:
                            re = re + f"-----------------\n反応: {a}"
                            re = re + f"\n返答: {status['group'][gid][a]['text']}"
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=re)]))
            else:
                line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text="ワードが一つも登録されていません")]))
         elif text == 'checkcredit':
            if not sender in slot:
                slot[sender] = {}
                slot[sender]["credit"] = 50
            else:
                pass
            line_bot_api.reply_message_with_http_info(ReplyMessageRequest(reply_token=op.reply_token,messages=[TextMessage(text=f"現在のクレジット:{slot[sender]['credit']}")]))
         elif text == 'スロット':
            line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[TextMessage(
                        text='開始しますか',
                        quick_reply=QuickReply(
                            items=[
                                QuickReplyItem(
                                    action=MessageAction(label="開始する", text="start:slot")
                                ),
                                QuickReplyItem(
                                    action=PostbackAction(label="やらない", data="skip")
                                )
                            ]
                        )
                    )]
                )
            )
         elif text == "オセロ":
            init = create_othello_board()
            flex = create_playable_othello_flex_message(init)
            line_bot_api.reply_message_with_http_info(
            ReplyMessageRequest(
                replyToken=op.reply_token,
                messages=[
                    FlexMessage(
                        altText="オセロ",
                        contents=FlexContainer.from_dict(flex),
                        quickReply=None,
                    )
                ],
                notificationDisabled=None,
            )
            )
         elif text == 'スロットhelp':
            buttons_template = ButtonsTemplate(
                title='スロットゲーム',
                text='Beta',
                actions=[
                    MessageAction(label='スロットを回す', text='スロット'),
                    MessageAction(label='スロットの残クレジット数を確認する', text='checkcredit')
                ])
            template_message = TemplateMessage(
                alt_text='スロットゲーム',
                template=buttons_template
            )
            line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[template_message]
                )
            )
         elif text == "start:slot":
            if sender in slot:
                result = slotgame(sender)
                line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[TextMessage(
                        text=f'結果: {result}\n現在のクレジット: {slot[sender]["credit"]}',
                        quick_reply=QuickReply(
                            items=[
                                QuickReplyItem(
                                    action=MessageAction(label="もう一度引く", text="start:slot")
                                ),
                                QuickReplyItem(
                                    action=PostbackAction(label="もうやめとく", data="skip")
                                )
                            ]
                        )
                    )]
                )
            )
            elif not sender in slot:
                slot[sender] = {}
                slot[sender]["credit"] = 50
                slot[sender]["BB"] = False
                result = slotgame(sender,slot[sender]["BB"])
                line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[TextMessage(
                        text=f'結果: {result}\n現在のクレジット: {slot[sender]["credit"]}',
                        quick_reply=QuickReply(
                            items=[
                                QuickReplyItem(
                                    action=MessageAction(label="もう一度引く", text="start:slot")
                                ),
                                QuickReplyItem(
                                    action=PostbackAction(label="もうやめとく", data="skip")
                                )
                            ]
                        )
                    )]
                )
            )
            else:
                pass
         elif text == 'leave':
            if isinstance(op.source, GroupSource):
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[TextMessage(text="ばいばい！")]
                    )
                )
                line_bot_api.leave_group(op.source.group_id)
            elif isinstance(op.source, RoomSource):
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[TextMessage(text="ばいばい！")]
                    )
                )
                line_bot_api.leave_room(room_id=op.source.room_id)
            else:
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[
                            TextMessage(text="個人トークじゃ退会できないよ！")
                        ]
                    )
                )
         elif text == "unsend":
            #line_bot_api.reply_message(
            #        ReplyMessageRequest(
            #            reply_token=op.reply_token,
            #            messages=[
            #                TextMessage(text="現在この機能はご利用いただくことができません")
            #            ]
            #        )
            #)
            if gid in unsend:
                rct = len(unsend[gid]["msgid"])
                ct = 0
                tt = "送信取り消しログ\n"
                for a in range(rct):
                    prof = json.loads(get_profile(token,gid,UserId))
                    NGTF = NgWordSystem.detect(msgdata[gid][unsend[gid]["msgid"][ct]])
                    NGTF_display = NgWordSystem.detect(prof['displayName'])
                    if NGTF is False and NGTF_display is False:
                        UserId = unsend[gid]["userid"][ct]
                        text = msgdata[gid][unsend[gid]["msgid"][ct]]
                        prof = json.loads(get_profile(token,gid,UserId))
                        displayName = prof['displayName']
                        tt += f"\n[{displayName}] {text}"
                        ct += 1
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[
                            TextMessage(text=tt)
                        ]
                    )
                )
            else:
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[
                            TextMessage(text="送信取り消しされてません")
                        ]
                    )
                )
         elif text == "参加挨拶切り替え":
            if gid in status["greeting"]:
                status["greeting"].remove(gid)
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[
                            TextMessage(text="参加挨拶しないように設定しました")
                        ]
                    )
                )
            elif not gid in status["greeting"]:
                status["greeting"].append(gid)
                if not gid in status["gred"]:
                    status["gred"][gid] = "よろしく！"
                line_bot_api.reply_message(
                    ReplyMessageRequest(
                        reply_token=op.reply_token,
                        messages=[
                            TextMessage(text="参加挨拶するように設定しました")
                        ]
                    )
                )
            else:
                pass

         elif text == "おみくじ":
            resp = json.loads(get_profile(token,gid,sender))['displayName']
            fortunes = ["大吉", "中吉", "小吉", "吉", "凶", "大凶"]
            selected_fortune = random.choice(fortunes)
            line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[
                        TextMessage(text=f"運勢は\n{selected_fortune}です")
                    ]
                )
            )
         elif text == '参加挨拶設定':
            if gid in status["greeting"]:
                fd="オン"
            else:
                fd="オフ"
            buttons_template = ButtonsTemplate(
                title='参加挨拶設定',
                text=f'現在参加挨拶は{fd}になっています',
                actions=[
                    MessageAction(label='参加挨拶メッセージを登録する', text='参加挨拶登録'),
                    MessageAction(label='参加挨拶をオン、またはオフにする', text='参加挨拶切り替え')
                ])
            template_message = TemplateMessage(
                alt_text='参加挨拶設定',
                template=buttons_template
            )
            line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=op.reply_token,
                    messages=[template_message]
                )
            )
         if text in status["group"][gid]:
            if status["group"][gid][text]["UserId"] == "RANDOM":
                res = json.loads(get_profile(token,gid,random.choice(groupmember[gid])))
                line_bot_api.reply_message_with_http_info(
                ReplyMessageRequest(
                    replyToken=op.reply_token,
                    messages=[
                        TextMessage(
                            text=status["group"][gid][text]["text"],
                            sender={
                                "name":res["displayName"],
                                "iconUrl":res["pictureUrl"]
                            }
                        )
                    ],
                    notificationDisabled=None,
                )
                )
            else:
                res = json.loads(get_profile(token,gid,status["group"][gid][text]["UserId"]))
                line_bot_api.reply_message_with_http_info(
                ReplyMessageRequest(
                    replyToken=op.reply_token,
                    messages=[
                        TextMessage(
                            text=status["group"][gid][text]["text"],
                            sender={
                                "name":res["displayName"],
                                "iconUrl":res["pictureUrl"]
                            }
                        )
                    ],
                    notificationDisabled=None,
                )
                )
         else:
            if not sender in lvdata["lv"]:
                lvdata["lv"][sender] = 1
            if not sender in lvdata["xp"]:
                lvdata["xp"][sender] = 0
            else:
                if lvdata["xp"][sender] == 100:
                    lvdata["xp"][sender] = 0
                    lvdata["lv"][sender] = lvdata["lv"][sender] + 1
                else:
                    lvdata["xp"][sender] = lvdata["xp"][sender] + 1

@handler.add(MemberJoinedEvent)
def handle_member_joined(event):
    if event.source.group_id in status["greeting"]:
        with ApiClient(configuration) as api_client:
            line_bot_api = MessagingApi(api_client)
            line_bot_api.reply_message(
                ReplyMessageRequest(
                    reply_token=event.reply_token,
                    messages=[TextMessage(text=status["gred"][event.source.group_id])]
                )
            )

@handler.add(PostbackEvent)
def handle_postback(event: PostbackEvent):
    with ApiClient(configuration) as api_client:
        line_bot_api = MessagingApi(api_client)
        if event.postback.data == 'skip':
            pass

@handler.add(JoinEvent)
def handle_join(event):
    with ApiClient(configuration) as api_client:
        line_bot_api = MessagingApi(api_client)
        line_bot_api.reply_message(
            ReplyMessageRequest(
                reply_token=event.reply_token,
                messages=[TextMessage(text=f"もやしbotです\nhelp で使い方が確認できます\n作者のTwitter: https://x.com/shota5561\nサポートOC: https://line.me/ti/g2/sAcQUnPUoED4n9pEYZRXXcOZD6ivox9pk7Zcfg")]
            )
        )

@handler.add(FollowEvent)
def handle_follow(event):
    with ApiClient(configuration) as api_client:
        line_bot_api = MessagingApi(api_client)
        line_bot_api.reply_message(
            ReplyMessageRequest(
                reply_token=event.reply_token,
                messages=[TextMessage(text='フォローしてくれてありがとう！')]
            )
        )
@handler.add(UnsendEvent)
def handle_unsend(event):
    type = event.source.type
    gid = event.source.group_id
    userid = event.source.user_id
    msgid = event.unsend.message_id
    if type in ["group","room"]:
        if not gid in unsend:
            unsend[gid] = {}
            unsend[gid]["msgid"] = []
            unsend[gid]["userid"] = []
        else:
            pass
        if 15 == len(unsend[gid]["msgid"]):
            unsend[gid]["msgid"].remove(unsend[gid]["msgid"][0]) #古い順から消す
            unsend[gid]["msgid"].append(msgid)
            unsend[gid]["userid"].append(userid)
        else:
            unsend[gid]["msgid"].append(msgid)
            unsend[gid]["userid"].append(userid)

@handler.add(MemberLeftEvent)
def handle_member_left(event):
    groupmember[event.source.group_id].append(event.source.user_id)

@handler.add(MessageEvent, message=(ImageMessageContent,
                                    VideoMessageContent,
                                    AudioMessageContent))
def handle_content_message(event):
    if isinstance(event.message, ImageMessageContent):
        ext = 'jpg'
    elif isinstance(event.message, VideoMessageContent):
        ext = 'mp4'
    elif isinstance(event.message, AudioMessageContent):
        ext = 'm4a'
    else:
        return
    if not ext == "m4a":
      if event.source.group_id in status["getdata"]:
        with ApiClient(configuration) as api_client:
            line_bot_blob_api = MessagingApiBlob(api_client)
            message_content = line_bot_blob_api.get_message_content(message_id=event.message.id)
            try:
                with tempfile.NamedTemporaryFile(dir=f"./datas/{event.source.group_id}/", prefix=ext + '-', delete=False) as tf:
                    tf.write(message_content)
                    tempfile_path = tf.name
            except:
                new_dir_path = f'datas/{event.source.group_id}'
                os.mkdir(new_dir_path)
                with tempfile.NamedTemporaryFile(dir=f"./datas/{event.source.group_id}/", prefix=ext + '-', delete=False) as tf:
                    tf.write(message_content)
                    tempfile_path = tf.name
        dist_path = tempfile_path + '.' + ext
        os.rename(tempfile_path, dist_path)
        pass
    elif ext == "m4a":
        with ApiClient(configuration) as api_client:
            line_bot_blob_api = MessagingApiBlob(api_client)
            message_content = line_bot_blob_api.get_message_content(message_id=event.message.id)
            try:
                with tempfile.NamedTemporaryFile(dir=f"./audio/", delete=False) as tf:
                    tf.write(message_content)
                    tempfile_path = tf.name
            except:
                new_dir_path = f'datas/{event.source.group_id}'
                os.mkdir(new_dir_path)
                with tempfile.NamedTemporaryFile(dir=f"./audio/", delete=False) as tf:
                    tf.write(message_content)
                    tempfile_path = tf.name
        dist_path = "audio_data" + '.' + ext
        os.rename(tempfile_path, dist_path)
        stream = ffmpeg.input("audio_data.m4a")
        stream = ffmpeg.output(stream, "result.wav")
        ffmpeg.run(stream,quiet=True)
        directory_path = "./result.wav"
        audio_data = load_audio_file(directory_path)
        text = transcribe_audio(audio_data)
        for a in NG:
            text = text.replace(a,"***")
        text = text.replace("黒沢","くろさわ") #身内用
        text = text.replace("黒澤","くろさわ") #身内用
        with ApiClient(configuration) as api_client:
            line_bot_api = MessagingApi(api_client)
            line_bot_api.reply_message(
            ReplyMessageRequest(
                    reply_token=event.reply_token,
                    messages=[
                        TextMessage(text=f'<音声認識>\n{text}')
                    ]
                )
            )
        os.remove('./result.wav')
    else:
        pass


@handler.add(MessageEvent, message=FileMessageContent)
def handle_file_message(event):
    with ApiClient(configuration) as api_client:
        line_bot_blob_api = MessagingApiBlob(api_client)
        message_content = line_bot_blob_api.get_message_content(message_id=event.message.id)
        try:
            with tempfile.NamedTemporaryFile(dir=f"./files/{event.source.group_id}/", prefix='file-', delete=False) as tf:
                tf.write(message_content)
                tempfile_path = tf.name
        except:
            new_dir_path = f'files/{event.source.group_id}'
            os.mkdir(new_dir_path)
            with tempfile.NamedTemporaryFile(dir=f"./files/{event.source.group_id}/", prefix='file-', delete=False) as tf:
                tf.write(message_content)
                tempfile_path = tf.name

    dist_path = tempfile_path + '-' + event.message.file_name
    os.rename(tempfile_path, dist_path)

@handler.add(UnknownEvent)
def handle_unknown_left(event):
    print(event)

@handler.add(UnfollowEvent)
def handle_unfollow(event):
    print(event)



app.run(port=5000)
